{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "batch_input_shape": [null, 48, 48, 1], "name": "conv2d_1", "filters": 64, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 128, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 128, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 256, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 256, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 512, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "padding": "same", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 512, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 512, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.4, "trainable": true, "noise_shape": null, "name": "dropout_5", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 256, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.4, "trainable": true, "noise_shape": null, "name": "dropout_6", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 128, "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_7", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 7, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_4", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "name": "sequential_1"}, "keras_version": "2.2.4", "backend": "tensorflow"}