{"config": {"name": "sequential_2", "layers": [{"config": {"dtype": "float32", "activation": "relu", "filters": 64, "batch_input_shape": [null, 112, 112, 3], "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_14", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_15", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_16", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_17", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_18", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_19", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_20", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_21", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_22", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_23", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_9", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_24", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_25", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_26", "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_regularizer": null, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_10", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "units": 1024, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 512, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 256, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_7", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 8, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_8", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}